app/Listeners/StoreloginHistory.php

    public function handle( UserLoginHistory $event )
    {
        $loginTime = Carbon::now()->toDateTimeString();

        $userDetails = $event->user;


        $input['first_name'] = $userDetails->first_name;

        $input['email'] = $userDetails->email;

        $input['login_time'] = $loginTime;

        // dd( $userDetails , $input);
        $saveHistory = ModelUserLoginHistory::create( $input );
---
insert into `model_user_login_histories` (`first_name`, `email`, `login_time`, `updated_at`, `created_at`) values ('Kamrul', 'kamrul.h01960@gmail.com', '2022-11-01 13:29:21', '2022-11-01 13:29:21', '2022-11-01 13:29:21')