app/Http/Controllers/AuthorController.php

    public function index()
    {
        return view('authors.index', [
            'pageTitle' => 'Authors',
            'authors' => Author::latest()->paginate(12)
        ]);
---
select * from `authors` order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `authors`

    public function store(Request $request)
    {
        $formRequest = $request->validate([
            'author_name' => 'required|min:4|max:30|unique:authors|regex:/^[a-zA-Z- ]*$/'
        ]);

        Author::create($formRequest);
---
insert into `authors` (`author_name`, `updated_at`, `created_at`) values ('Rabbi Mahmud', '2022-11-01 14:02:24', '2022-11-01 14:02:24')

    public function manage()
    {
        return view('authors.manage', [
            'pageTitle' => 'Manage Authors',
            'authors' => Author::latest()->paginate(6)
---
select * from `authors` order by `created_at` desc limit 6 offset 0
select count(*) as aggregate from `authors`

    public function update(Request $request, $id)
    {
        $formRequest = $request->validate([
            'author_name' => 'required|min:4|max:30|unique:authors|regex:/^[a-zA-Z- ]*$/'
        ]);

        Author::where('id', $id)->update($formRequest);
---
update `authors` set `author_name` = 'Ariful Islam', `authors`.`updated_at` = '2022-11-01 01:50:44' where `id` = '29'

    public function destroy($id) {

        Author::where('id', $id)->delete();
---
delete from `authors` where `id` = '32'