app/Http/Controllers/BooksController.php

select * from `books` where `books`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `books` where `books`.`deleted_at` is null
---
    public function index()
    {
        $data = [
            'pageTitle' => 'এসো বই পড়ি | Book List',
            'books' => Book::latest()->filter(request(['search']))->paginate(10)
        ];