app/Http/Controllers/UserController.php

insert into `users` (`first_name`, `last_name`, `email`, `phone`, `password`, `updated_at`, `created_at`) values ('Kamrul', 'Hasan', 'kamrul.h01960@gmail.com', '01960844035', '$2y$10$/63W2dxGz21J0s3dTB4y9eBb9ocKY35GbTwkHmxmwG8cEDBlJGCU2', '2022-10-31 00:48:04', '2022-10-31 00:48:04')
---
    public function validate_registration( Request $request )
    {
        $request->validate( [

            'first_name' => ['required','regex:/^[\pL\s\-]+$/u', 'string', 'max:255'],
            'last_name'  => ['required', 'regex:/^[\pL\s\-]+$/u','string', 'max:255'],
            'email'      => ['required', 'string', 'email', 'max:255', 'unique:users'],
            'phone'      => ['required', 'string', 'max:20', 'unique:users'],
            'password'   => ['required', 'string', 'min:8', 'confirmed'],
        ] );

        $data = $request->all();

        User::create( [
            'first_name' => $data['first_name'],
            'last_name'  => $data['last_name'],
            'email'      => $data['email'],
            'phone'      => $data['phone'],
            'password'   => Hash::make( $data['password'] ),
        ] );