app/Http/Controllers/VendorsController.php

select count(*) as aggregate from `vendors`
---
    public function index()
    {
        $pagination = NULL;
        $data = [
            'pageTitle' => 'এসো বই পড়ি | Vendor List',
            'vendors' => Vendor::latest()->paginate(5)

        ];